In [9]:
import pandas as pd

# Q1. List any five functions of the pandas library with execution.

- read_csv(): This function is used to read data from a CSV file and create a DataFrame.

In [7]:
df = pd.read_csv('https://gist.githubusercontent.com/armgilles/194bcff35001e7eb53a2a8b441e8b2c6/raw/92200bc0a673d5ce2110aaad4544ed6c4010f687/pokemon.csv')

- head(): This function returns the first few rows of a DataFrame.

In [8]:
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

- describe(): This function generates descriptive statistics of the numerical columns in a DataFrame.

In [9]:
df.describe()

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.00000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,435.10250,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,119.96304,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,180.00000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,330.00000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,450.00000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,515.00000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,780.00000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

- groupby(): This function is used to group data based on one or more columns and perform aggregations.

In [10]:
grouped_data = df.groupby('Type 1')
mean_values = grouped_data['Total'].mean()
print(mean_values)

Type 1
Bug         378.927536
Dark        445.741935
Dragon      550.531250
Electric    443.409091
Fairy       413.176471
Fighting    416.444444
Fire        458.076923
Flying      485.000000
Ghost       439.562500
Grass       421.142857
Ground      437.500000
Ice         433.458333
Normal      401.683673
Poison      399.142857
Psychic     475.947368
Rock        453.750000
Steel       487.703704
Water       430.455357
Name: Total, dtype: float64

- to_csv(): This function is used to write a DataFrame to a CSV file.

In [11]:
df.to_csv('pokemon_data.csv', index=False)

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})
print(df)

print('After reindexing')

print(df.reindex(list(range(1,len(df)+1,2))))

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90
After reindexing
      A     B     C
1  20.0  50.0  80.0
3   NaN   NaN   NaN

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [19]:
def find_sum(series):
    print(series[:3].sum())
    
df = pd.DataFrame({'Values':[10,20,30,40,50]})
find_sum(df['Values'])

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [20]:
df = pd.DataFrame({'Text': [
        'Charizard flies around the sky in search of powerful opponents.',
        'Tyranitar is so overwhelmingly powerful, it can bring down a whole mountain to make its nest.',
        'Gardevoir has the ability to read the future and will always protect its Trainer from harm.',
        'Lucario reads its opponent\'s movements and attacks with precise strikes of its aura.',
        'Decidueye is able to attack its opponents without making a sound, thanks to its stealthy nature.'
    ]})

df['word_count'] = df['Text'].apply(lambda x: len(x.split()))
df

                                                Text  word_count
0  Charizard flies around the sky in search of po...          10
1  Tyranitar is so overwhelmingly powerful, it ca...          16
2  Gardevoir has the ability to read the future a...          16
3  Lucario reads its opponent's movements and att...          13
4  Decidueye is able to attack its opponents with...          16

# Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in the DataFrame, which is equivalent to the total number of cells or values in the DataFrame. It gives you the size of the DataFrame in terms of the number of elements.

DataFrame.shape() returns a tuple representing the dimensions of the DataFrame. It returns the number of rows and columns in the DataFrame. The shape is expressed as (rows, columns).

In [21]:
print(df.shape)
print(df.size)

(5, 2)
10

# Q6. Which function of pandas do we use to read an excel file?

the <b>read_excel()<b> function reads the contents of an  Excel file .

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [27]:
df= pd.DataFrame({'Email': ['john.doe@gmail.com', 'jane.smith@hotmail.com', 'mark.johnson@yahoo.com']})

df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
df

                    Email      Username
0      john.doe@gmail.com      john.doe
1  jane.smith@hotmail.com    jane.smith
2  mark.johnson@yahoo.com  mark.johnson

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [29]:
def select_rows(df):
    return df[(df['A'] > 5) & (df['B'] <10)]

df = pd.DataFrame({'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]})

select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [31]:
df = pd.DataFrame({'Values':[10,20,30,40,50]})
print('Mean',df['Values'].mean())
print('Median',df['Values'].median())
print('Standard Deviation',df['Values'].std())

Mean 30.0
Median 30.0
Standard Deviation 15.811388300841896

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [33]:
df = pd.DataFrame({'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60],
        'Date': pd.date_range(start='2023-06-01', periods=11)})

df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
df

    Sales       Date  MovingAverage
0      10 2023-06-01           10.0
1      15 2023-06-02           12.5
2      20 2023-06-03           15.0
3      25 2023-06-04           17.5
4      30 2023-06-05           20.0
5      35 2023-06-06           22.5
6      40 2023-06-07           25.0
7      45 2023-06-08           30.0
8      50 2023-06-09           35.0
9      55 2023-06-10           40.0
10     60 2023-06-11           45.0

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.

In [40]:
def weekdays(df):
    df['Weekday'] = df['Date'].apply(lambda x:x.day_name())
    return df
df = pd.DataFrame({'Date':pd.date_range(start='2023-01-01',end='2023-01-05')})

weekdays(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [47]:
df = pd.DataFrame({'Date':pd.date_range(start='2022-12-10',end='2023-02-15',freq=pd.DateOffset(days=5))})
start_date = pd.to_datetime('2023-01-01')
end_date = pd.to_datetime('2023-01-31')
df[ ( df['Date']>=start_date) & (df['Date']<=end_date) ]

         Date
5  2023-01-04
6  2023-01-09
7  2023-01-14
8  2023-01-19
9  2023-01-24
10 2023-01-29

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of Pandas, the first and foremost necessary library that needs to be imported is pandas itself.

It can be imported by : `import pandas as pd`

where pd is an alias